Enums/ВариантыАрхивацииПрикрепленныхДанных.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ВариантыАрхивацииПрикрепленныхДанных</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЛокальныйДиск</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>GoogleDrive</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЯндексДиск</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВариантыАрхивацииПрикрепленныхДанных/Ext/ManagerModule.bsl
Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ДанныеВыбора = Новый СписокЗначений;
	Если Не ПараметрыСеанса.ЭтоОблако Тогда
		ДанныеВыбора.Добавить(Перечисления.ВариантыАрхивацииПрикрепленныхДанных.ЛокальныйДиск);
	КонецЕсли;
	ДанныеВыбора.Добавить(Перечисления.ВариантыАрхивацииПрикрепленныхДанных.GoogleDrive);
	ДанныеВыбора.Добавить(Перечисления.ВариантыАрхивацииПрикрепленныхДанных.ЯндексДиск);
	
КонецПроцедуры
